---
kind: method
id: M:Autodesk.Revit.DB.AreaFilter.#ctor
source: html/5d66b464-9c61-6069-e278-d4f4428b2bef.htm
---
# Autodesk.Revit.DB.AreaFilter.#ctor Method

Constructs a filter which matches only areas.

## Syntax (C#)
```csharp
public AreaFilter()
```